; domain
(define (domain maze-world)
	(:requirements :typing)
	(:types cell adventurer)
	(:predicates
		(in-cell ?a - adventurer ?c - cell)
		(adjacent ?a - cell ?b - cell)
		(has-wall ?a - cell)
	)
	(:action move-cells
		:parameters (?a - cell ?b - cell ?c - adventurer)
		:precondition (and
			(adjacent ?a ?b)
			(in-cell ?c ?a)
			(not (has-wall ?b))
		)
		:effect (and
			(not (in-cell ?c ?a))
			(in-cell ?c ?b)
			)
	)
)

; problem
(define (problem maze-world-a)
	(:domain maze-world)
	(:objects cell_1_1 cell_1_2 cell_1_3 cell_2_1 cell_2_2 cell_2_3 cell_3_1 cell_3_2 cell_3_3 - cell bevo - adventurer)
	(:init
		(adjacent cell_1_1 cell_1_2)
		(adjacent cell_1_2 cell_1_3)

		(adjacent cell_2_1 cell_2_2)
		(adjacent cell_2_2 cell_2_3)

		(adjacent cell_3_1 cell_3_2)
		(adjacent cell_3_2 cell_3_3)

		(adjacent cell_1_2 cell_1_1)
		(adjacent cell_1_3 cell_1_2)

		(adjacent cell_2_2 cell_2_1)
		(adjacent cell_2_3 cell_2_2)

		(adjacent cell_3_2 cell_3_1)
		(adjacent cell_3_3 cell_3_2)

		(adjacent cell_1_1 cell_2_1)
		(adjacent cell_2_1 cell_3_1)

		(adjacent cell_1_2 cell_2_2)
		(adjacent cell_2_2 cell_3_2)

		(adjacent cell_1_3 cell_2_3)
		(adjacent cell_2_3 cell_3_3)

		(adjacent cell_2_1 cell_1_1)
		(adjacent cell_3_1 cell_2_1)

		(adjacent cell_2_2 cell_1_2)
		(adjacent cell_3_2 cell_2_2)

		(adjacent cell_2_3 cell_1_3)
		(adjacent cell_3_3 cell_2_3)

		(has-wall cell_2_1)
		(has-wall cell_2_2)

		(in-cell bevo cell_3_1)

	)
	(:goal
		(and
			(in-cell bevo cell_1_1)
		)
	)
)

; plan
1. (move-cells cell_3_1 cell_3_2 bevo)
   deleted: (in-cell bevo cell_3_1)
   added: (in-cell bevo cell_3_2)
   goals met: 0 of 1
2. (move-cells cell_3_2 cell_3_3 bevo)
   deleted: (in-cell bevo cell_3_2)
   added: (in-cell bevo cell_3_3)
   goals met: 0 of 1
3. (move-cells cell_3_3 cell_2_3 bevo)
   deleted: (in-cell bevo cell_3_3)
   added: (in-cell bevo cell_2_3)
   goals met: 0 of 1
4. (move-cells cell_2_3 cell_1_3 bevo)
   deleted: (in-cell bevo cell_2_3)
   added: (in-cell bevo cell_1_3)
   goals met: 0 of 1
5. (move-cells cell_1_3 cell_1_2 bevo)
   deleted: (in-cell bevo cell_1_3)
   added: (in-cell bevo cell_1_2)
   goals met: 0 of 1
6. (move-cells cell_1_2 cell_1_1 bevo)
   deleted: (in-cell bevo cell_1_2)
   added: (in-cell bevo cell_1_1)
   goals met: 1 of 1
